# Brewfile for macOS setup
# Install with: brew bundle --file=~/Developer/dotfiles/Brewfile

# Taps
tap "nikitabobko/tap"  # aerospace
tap "amar1729/formulae"  # browserpass

# Core CLI tools
brew "stow"           # Dotfiles management
brew "neovim"         # Editor
brew "tmux"           # Terminal multiplexer
brew "git"            # Version control
brew "git-delta"      # Better git diffs
brew "git-lfs"        # Large file storage
brew "gitui"          # Git TUI
brew "micromamba"     # Conda environment manager
brew "syncthing"      # File synchronization
brew "rclone"         # Mount remote filesystems (sshfs alternative)
brew "rsync"          # Fast file sync (newer than macOS built-in)
brew "tealdeer"       # Simplified man pages (tldr)
brew "ouch"           # Universal compression tool

# Shell
brew "zsh-syntax-highlighting"
brew "powerlevel10k"
brew "atuin"          # Synced shell history across machines

# Search and navigation
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "eza"            # Modern ls
brew "bat"            # Cat with syntax highlighting
brew "yazi"           # File manager
brew "zoxide"         # Smart cd - remembers frequent dirs

# Development
brew "direnv"         # Per-directory env vars
brew "node"           # For LSP servers
brew "python"         # Base Python
brew "r"              # R language
brew "just"           # Modern make alternative
brew "tokei"          # Count lines of code by language
brew "hyperfine"      # Benchmarking tool

# Documents and writing
brew "pandoc"         # Document converter
brew "vale"           # Prose linter

# Media
brew "mpv"            # Video player (for yazi)

# Security
brew "gnupg"          # GPG encryption
brew "pinentry-mac"   # GPG PIN entry for macOS
brew "pass"           # Password store
brew "amar1729/formulae/browserpass"  # Browser integration for pass (run post-install cmd)
brew "restic"         # Backup tool (encrypted, deduplicated)

# System monitoring
brew "bottom"         # Resource monitor (Rust-based, run with 'btm')
brew "dust"           # Disk usage viewer
brew "procs"          # Modern ps replacement

# System utilities (Casks)
cask "raycast"        # Spotlight replacement
cask "karabiner-elements"  # Keyboard customization

# GUI Applications (Casks)
cask "kitty"          # Terminal emulator
cask "nikitabobko/tap/aerospace"  # Tiling window manager
cask "quarto"         # Scientific publishing
cask "calibre"        # E-book management
cask "zotero"         # Reference manager
cask "sioyek"         # Academic PDF reader
cask "digikam"        # Photo management
cask "gimp"           # Image editor

# Productivity
cask "todoist"        # Task management

# Communication
cask "firefox"        # Browser
cask "thunderbird"    # Email + calendar
cask "ferdium"        # Multi-messenger (WhatsApp, Telegram, etc.)

# Media
# feishin - install manually from https://github.com/jeffvli/feishin/releases

# Remote access
cask "rustdesk"       # Open-source remote desktop

# Nerd Fonts (from your xresources)
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-iosevka-nerd-font"
