# Brewfile for macOS setup
# Install with: brew bundle --file=~/Developer/dotfiles/Brewfile

# Taps
tap "nikitabobko/tap"  # aerospace

# Core CLI tools
brew "stow"           # Dotfiles management
brew "neovim"         # Editor
brew "tmux"           # Terminal multiplexer
brew "git"            # Version control
brew "git-delta"      # Better git diffs
brew "git-lfs"        # Large file storage
brew "micromamba"     # Conda environment manager
brew "syncthing"      # File synchronization
brew "rclone"         # Mount remote filesystems (sshfs alternative)
brew "rsync"          # Fast file sync (newer than macOS built-in)

# Shell
brew "zsh-syntax-highlighting"
brew "powerlevel10k"

# Search and navigation
brew "fzf"            # Fuzzy finder
brew "ripgrep"        # Fast grep
brew "fd"             # Fast find
brew "eza"            # Modern ls
brew "bat"            # Cat with syntax highlighting
brew "yazi"           # File manager

# Development
brew "direnv"         # Per-directory env vars
brew "node"           # For LSP servers
brew "python"         # Base Python
brew "r"              # R language

# Documents and writing
brew "pandoc"         # Document converter
brew "vale"           # Prose linter

# Media
brew "mpv"            # Video player (for yazi)

# Security
brew "gnupg"          # GPG encryption
brew "pinentry-mac"   # GPG PIN entry for macOS
brew "pass"           # Password store

# System monitoring
brew "btop"           # Resource monitor (rust-based)

# System utilities (Casks)
cask "raycast"        # Spotlight replacement
cask "karabiner-elements"  # Keyboard customization

# GUI Applications (Casks)
cask "kitty"          # Terminal emulator
cask "nikitabobko/tap/aerospace"  # Tiling window manager
cask "quarto"         # Scientific publishing
cask "calibre"        # E-book management
cask "zotero"         # Reference manager
cask "digikam"        # Photo management
cask "gimp"           # Image editor

# Nerd Fonts (from your xresources)
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-iosevka-nerd-font"
